cf/DataProcessors/ПримерИспользованияПрогрессБараВОбработкеНаСервере.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ПримерИспользованияПрогрессБараВОбработкеНаСервере</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ПрогрессБар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессБар</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/ПримерИспользованияПрогрессБараВОбработкеНаСервере/Ext/ObjectModule.bsl
Процедура ОбработатьНаСервере(ИмяФормы) Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	Ссылка
	                    |ИЗ
	                    |	Документ.ИнтернетЗаказПокупателя  ");
	Выборка=Запрос.Выполнить().Выбрать();
	
	//обязательная часть кода №1
	Всего = Выборка.Количество();
	Счетчик=0;
	ПредСчетчик=0;
	Состояние="Выполнение этапа №...";
	//
	
	Пока Выборка.Следующий() Цикл
		
		//обязательная часть кода №2
		Счетчик=Счетчик+1;
		РегистрыСведений.ПрогрессБар.УстановитьЗначение(ИмяФормы,Счетчик,ПредСчетчик,Всего,Состояние);
		ПредСчетчик=Счетчик;		
		//
		
	КонецЦикла	
КонецПроцедуры
